# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# Modified: Added CBAM attention modules

# Parameters
nc: 3 # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels
ch: 6  # 双输入: 3(RGB) + 3(IR) = 6

# YOLOv8.0n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, CBAM, [128]]           # 3 ← 插入 CBAM
  - [-1, 1, Conv, [256, 3, 2]]     # 4-P3/8
  - [-1, 6, C2f, [256, True]]      # 5
  - [-1, 1, CBAM, [256]]           # 6 ← 插入 CBAM
  - [-1, 1, Conv, [512, 3, 2]]     # 7-P4/16
  - [-1, 6, C2f, [512, True]]      # 8
  - [-1, 1, CBAM, [512]]           # 9 ← 插入 CBAM
  - [-1, 1, Conv, [1024, 3, 2]]    # 10-P5/32
  - [-1, 3, C2f, [1024, True]]     # 11
  - [-1, 1, CBAM, [1024]]          # 12 ← 插入 CBAM
  - [-1, 1, SPPF, [1024, 5]]       # 13

# YOLOv8.0n head (索引已调整)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]      # 连接 backbone P4 (原6改为9)
  - [-1, 3, C2f, [512]]            # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]      # 连接 backbone P3 (原4改为5)
  - [-1, 3, C2f, [256]]            # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]     # 连接 head P4 (原12改为16)
  - [-1, 3, C2f, [512]]            # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # 连接 backbone SPPF (原9改为13)
  - [-1, 3, C2f, [1024]]           # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect_v8, [nc]]  # Detect(P3, P4, P5)